1317/SmartCar_STM32_Based/User/adc/bsp_adc.h
#ifndef __ADC_H
#define	__ADC_H


#include "stm32f10x.h"

// 注意：用作ADC采集的IO必须没有复用，否则采集电压会有影响
/********************ADC3输入通道（引脚）配置**************************/
#define    ADC_APBxClock_FUN             RCC_APB2PeriphClockCmd
#define    ADC_CLK                       RCC_APB2Periph_ADC3//RCC_APB2Periph_ADC1

#define    ADC_GPIO_APBxClock_FUN        RCC_APB2PeriphClockCmd
#define    ADC_GPIO_CLK                  RCC_APB2Periph_GPIOC  
#define    ADC_PORT                      GPIOC

/*以下三行是为移植到新生主板而增加的*/
#define    ADC_GPIO_APBxClock_FUN2        RCC_APB2PeriphClockCmd
#define    ADC_GPIO_CLK2                  RCC_APB2Periph_GPIOF
#define    ADC_PORT2                      GPIOF


// 注意
// 1-PC0 在霸道里面接的是蜂鸣器，默认被拉低
// 2-PC0 在指南者里面接的是SPI FLASH的 片选，默认被拉高
// 所以 PC0 做 ADC 转换通道的时候，结果可能会有误差

// 转换通道个数
#define    NOFCHANEL										 5//6

#define    ADC_PIN1                      GPIO_Pin_0
#define    ADC_CHANNEL1                  ADC_Channel_10

#define    ADC_PIN2                      GPIO_Pin_1
#define    ADC_CHANNEL2                  ADC_Channel_11

#define    ADC_PIN3                      GPIO_Pin_8//GPIO_Pin_2
#define    ADC_CHANNEL3                  ADC_Channel_6//ADC_Channel_12

#define    ADC_PIN4                      GPIO_Pin_9//GPIO_Pin_3
#define    ADC_CHANNEL4                  ADC_Channel_7//ADC_Channel_13

#define    ADC_PIN5                      GPIO_Pin_10//GPIO_Pin_4
#define    ADC_CHANNEL5                  ADC_Channel_8//ADC_Channel_14

#if 0	//因为只在新生主板上只采集五个通道的模拟量，因此第六个通道不使用
#define    ADC_PIN6                      GPIO_Pin_5
#define    ADC_CHANNEL6                  ADC_Channel_15
#endif

// ADC1 对应 DMA1通道1，ADC3对应DMA2通道5，ADC2没有DMA功能
#define    ADC_x                         ADC3//ADC1
#define    ADC_DMA_CHANNEL               DMA2_Channel5//DMA1_Channel1
#define    ADC_DMA_CLK                   RCC_AHBPeriph_DMA2//RCC_AHBPeriph_DMA1


/**************************函数声明********************************/
void               ADCx_Init                               (void);


#endif /* __ADC_H */

